#---------------------------------------------------------------------------------------------------------------------------------------mqtt_controller.py 配置文件------------------------------------------------------------------------------------------------------------------------------------------#
# ==============================
# 主逻辑1 的日志配置
# ==============================
LOG_CONFIG_MAIN1 = {
    "log_path": "/home/pi/Raspberry_Pi/logs/mqtt_controller.log",
    "max_bytes": 5 * 1024 * 1024,
    "backup_count": 5,
    "format": "%(asctime)s - MAIN1 - %(levelname)s - %(message)s"
}

# ==============================
# 图片配置文件
# ==============================
LOCAL_DIR = "/home/pi/Raspberry_Pi/Local_image"
USE_TIMESTAMP = True

#===============================
# 空气温湿度传感器
#===============================
READ_TIMEOUT = 2
MIN_TEMP = -40
MAX_TEMP = 85
MIN_HUMI = 0
MAX_HUMI = 100

#===============================
# 土壤湿度传感器
#===============================
SOIL_PIN = 17
READ_DELAY = 1
# 纯数字代替GPIO常量！0=LOW,1=HIGH
SOIL_WET_LEVEL = 0   
SOIL_DRY_LEVEL = 1   

#================================
#SFTP协议
#================================
SERVER_IP = "39.106.159.23"
USERNAME = "root"
PASSWORD = "LjJ@0809!12"
REMOTE_DIR = "/ShujuTp/"

#-----------------------------------------------------------------------------sensor_uploader.py 配置文件-------------------------------------------------------------------------#
# ==============================
# 主逻辑1 的日志配置
# ==============================
LOG_CONFIG_MAIN2 = {
    "log_path": "/home/pi/Raspberry_Pi/logs/sensor_uploader.log",
    "max_bytes": 5 * 1024 * 1024,
    "backup_count": 5,
    "format": "%(asctime)s - MAIN1 - %(levelname)s - %(message)s"
}
